{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/guest/r12922121/ADL_2023_NTU/hw3/Taiwan-LLM-7B-v2.0-chat",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 64,
  "lora_dropout": 0.02,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "down_proj",
    "up_proj",
    "q_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "k_proj"
  ],
  "task_type": "CAUSAL_LM"
}